
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/haruguchi-yuma/aws-ecs-terraform/actions/runs/14288149887)



<pre><code>Apply complete! Resources: 3 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/248fcb71-c713-4fa4-a56f-5a1aa7920eaa/terraform-bin apply -auto-approve -input=false
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP form ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "go-simple-server-alb"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-alb"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-alb"
        }
      + vpc_id                 = "vpc-02a7999140cb7d46b"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "go-simple-server-ecs"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "go-simple-server-ecs"
        }
      + tags_all               = {
          + "Name" = "go-simple-server-ecs"
        }
      + vpc_id                 = "vpc-02a7999140cb7d46b"
    }

  # aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow 8080 from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
aws_security_group.ecs: Creating...
aws_security_group.alb: Creating...
aws_security_group.ecs: Creation complete after 4s [id=sg-0cf92546af3fca408]
aws_security_group.alb: Creation complete after 4s [id=sg-064f56ad0151fd4c4]
aws_security_group_rule.ecs_from_alb: Creating...
aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-4274032936]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
::debug::Terraform exited with code 0.
::debug::stdout: Acquiring state lock. This may take a few moments...%0Amodule.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02a7999140cb7d46b]%0Amodule.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-083b13fd8062f5801]%0Amodule.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-01a98b100a9e90a27]%0Amodule.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00a371ec09c5c42c7]%0Amodule.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0c79b8ce30703dd14]%0Amodule.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-056447c0f16234a92]%0Amodule.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0de12d0e72aff9d6a]%0Amodule.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cd033fa9e54ffeb8]%0Amodule.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0ebdf5ff77b8d2269]%0Amodule.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0683321158553d692]%0Amodule.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-08c4c6f0fdf563338]%0Amodule.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-054620f453b63a8dd]%0Amodule.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02ee760d8bf1079fa]%0Amodule.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0e7655c2afa897b05]%0Amodule.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-054620f453b63a8dd1080289494]%0Amodule.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07102b0ebd9f490c1]%0Amodule.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-07699eac2ec2333ab]%0Amodule.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-036840bbfc61d3a71]%0Amodule.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084cb5bd4ae4d314c]%0Amodule.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0a29804183b7a0528]%0Amodule.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-04324b55eef143096]%0Amodule.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0ebdf5ff77b8d22691080289494]%0Amodule.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cd033fa9e54ffeb81080289494]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # aws_security_group.alb will be created%0A  + resource "aws_security_group" "alb" {%0A      + arn                    = (known after apply)%0A      + description            = "For ALB."%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow all to outbound."%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow HTTP form ALL."%0A              + from_port        = 80%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "tcp"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 80%0A            },%0A        ]%0A      + name                   = "go-simple-server-alb"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "go-simple-server-alb"%0A        }%0A      + tags_all               = {%0A          + "Name" = "go-simple-server-alb"%0A        }%0A      + vpc_id                 = "vpc-02a7999140cb7d46b"%0A    }%0A%0A  # aws_security_group.ecs will be created%0A  + resource "aws_security_group" "ecs" {%0A      + arn                    = (known after apply)%0A      + description            = "For ECS."%0A      + egress                 = [%0A          + {%0A              + cidr_blocks      = [%0A                  + "0.0.0.0/0",%0A                ]%0A              + description      = "Allow all to outbound."%0A              + from_port        = 0%0A              + ipv6_cidr_blocks = []%0A              + prefix_list_ids  = []%0A              + protocol         = "-1"%0A              + security_groups  = []%0A              + self             = false%0A              + to_port          = 0%0A            },%0A        ]%0A      + id                     = (known after apply)%0A      + ingress                = (known after apply)%0A      + name                   = "go-simple-server-ecs"%0A      + name_prefix            = (known after apply)%0A      + owner_id               = (known after apply)%0A      + revoke_rules_on_delete = false%0A      + tags                   = {%0A          + "Name" = "go-simple-server-ecs"%0A        }%0A      + tags_all               = {%0A          + "Name" = "go-simple-server-ecs"%0A        }%0A      + vpc_id                 = "vpc-02a7999140cb7d46b"%0A    }%0A%0A  # aws_security_group_rule.ecs_from_alb will be created%0A  + resource "aws_security_group_rule" "ecs_from_alb" {%0A      + description              = "Allow 8080 from Security Group for ALB."%0A      + from_port                = 8080%0A      + id                       = (known after apply)%0A      + protocol                 = "tcp"%0A      + security_group_id        = (known after apply)%0A      + security_group_rule_id   = (known after apply)%0A      + self                     = false%0A      + source_security_group_id = (known after apply)%0A      + to_port                  = 8080%0A      + type                     = "ingress"%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0Aaws_security_group.ecs: Creating...%0Aaws_security_group.alb: Creating...%0Aaws_security_group.ecs: Creation complete after 4s [id=sg-0cf92546af3fca408]%0Aaws_security_group.alb: Creation complete after 4s [id=sg-064f56ad0151fd4c4]%0Aaws_security_group_rule.ecs_from_alb: Creating...%0Aaws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-4274032936]%0AReleasing state lock. This may take a few moments...%0A%0AApply complete! Resources: 3 added, 0 changed, 0 destroyed.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"32a71597445b8f7a94f175577f5fd6210fa721f9","Vars":{},"WorkflowName":"Terraform"} -->